rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date
---
  def index
    @all_ratings = Movie.all_ratings
    redirect = false
    logger.debug(session.inspect)
    if params[:sort_by]
      @sort_by = params[:sort_by]
      session[:sort_by] = params[:sort_by]
    elsif session[:sort_by]
      @sort_by = session[:sort_by]
      redirect = true
    else
      @sort_by = nil
    end
    if params[:commit] == "Refresh" and params[:ratings].nil?
      @ratings = nil
      session[:ratings] = nil
    elsif params[:ratings]
      @ratings = params[:ratings]
      session[:ratings] = params[:ratings]
    elsif session[:ratings]
      @ratings = session[:ratings]
      redirect = true
    else
      @ratings = nil
    end
    if redirect
      flash.keep
      redirect_to movies_path :sort_by=>@sort_by, :ratings=>@ratings
    end
    if @ratings and @sort_by
      @movies = Movie.where(:rating => @ratings.keys).find(:all, :order => (@sort_by))

SELECT "movies".* FROM "movies" ORDER BY release_date
---
    elsif @sort_by
      @movies = Movie.find(:all, :order => (@sort_by))
    else
      @movies = Movie.all